x_train shape: (77073, 50, 50, 1)
y_train shape: (77073,)
Number of images in x_train 77073
Number of images in x_valid 11011
Number of images in x_test 22022
Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 50, 50, 1)]  0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 50, 50, 1)    0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 22, 22, 64)   3200        dropout[0][0]                    
__________________________________________________________________________________________________
bn_conv1 (BatchNormalization)   (None, 22, 22, 64)   256         conv1[0][0]                      
__________________________________________________________________________________________________
activation (Activation)         (None, 22, 22, 64)   0           bn_conv1[0][0]                   
__________________________________________________________________________________________________
pool1_pad (ZeroPadding2D)       (None, 24, 24, 64)   0           activation[0][0]                 
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 11, 11, 64)   0           pool1_pad[0][0]                  
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 11, 11, 64)   4160        max_pooling2d[0][0]              
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 11, 11, 64)   256         res2a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 11, 11, 64)   0           bn2a_branch2a[0][0]              
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 11, 11, 64)   36928       activation_1[0][0]               
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 11, 11, 64)   256         res2a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 11, 11, 64)   0           bn2a_branch2b[0][0]              
__________________________________________________________________________________________________
res2a_branch2c (Conv2D)         (None, 11, 11, 256)  16640       activation_2[0][0]               
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, 11, 11, 256)  16640       max_pooling2d[0][0]              
__________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizati (None, 11, 11, 256)  1024        res2a_branch2c[0][0]             
__________________________________________________________________________________________________
bn2a_branch1 (BatchNormalizatio (None, 11, 11, 256)  1024        res2a_branch1[0][0]              
__________________________________________________________________________________________________
add (Add)                       (None, 11, 11, 256)  0           bn2a_branch2c[0][0]              
                                                                 bn2a_branch1[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 11, 11, 256)  0           add[0][0]                        
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 11, 11, 64)   16448       activation_3[0][0]               
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 11, 11, 64)   256         res2b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 11, 11, 64)   0           bn2b_branch2a[0][0]              
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 11, 11, 64)   36928       activation_4[0][0]               
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 11, 11, 64)   256         res2b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 11, 11, 64)   0           bn2b_branch2b[0][0]              
__________________________________________________________________________________________________
res2b_branch2c (Conv2D)         (None, 11, 11, 256)  16640       activation_5[0][0]               
__________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizati (None, 11, 11, 256)  1024        res2b_branch2c[0][0]             
__________________________________________________________________________________________________
add_1 (Add)                     (None, 11, 11, 256)  0           bn2b_branch2c[0][0]              
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 11, 11, 256)  0           add_1[0][0]                      
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 11, 11, 64)   16448       activation_6[0][0]               
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 11, 11, 64)   256         res2c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 11, 11, 64)   0           bn2c_branch2a[0][0]              
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 11, 11, 64)   36928       activation_7[0][0]               
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 11, 11, 64)   256         res2c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 11, 11, 64)   0           bn2c_branch2b[0][0]              
__________________________________________________________________________________________________
res2c_branch2c (Conv2D)         (None, 11, 11, 256)  16640       activation_8[0][0]               
__________________________________________________________________________________________________
bn2c_branch2c (BatchNormalizati (None, 11, 11, 256)  1024        res2c_branch2c[0][0]             
__________________________________________________________________________________________________
add_2 (Add)                     (None, 11, 11, 256)  0           bn2c_branch2c[0][0]              
                                                                 activation_6[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 11, 11, 256)  0           add_2[0][0]                      
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 6, 6, 128)    32896       activation_9[0][0]               
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 6, 6, 128)    512         res3a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 6, 6, 128)    0           bn3a_branch2a[0][0]              
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 6, 6, 128)    147584      activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 6, 6, 128)    512         res3a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 6, 6, 128)    0           bn3a_branch2b[0][0]              
__________________________________________________________________________________________________
res3a_branch2c (Conv2D)         (None, 6, 6, 512)    66048       activation_11[0][0]              
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 6, 6, 512)    131584      activation_9[0][0]               
__________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizati (None, 6, 6, 512)    2048        res3a_branch2c[0][0]             
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 6, 6, 512)    2048        res3a_branch1[0][0]              
__________________________________________________________________________________________________
add_3 (Add)                     (None, 6, 6, 512)    0           bn3a_branch2c[0][0]              
                                                                 bn3a_branch1[0][0]               
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 6, 6, 512)    0           add_3[0][0]                      
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 6, 6, 128)    65664       activation_12[0][0]              
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 6, 6, 128)    512         res3b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 6, 6, 128)    0           bn3b_branch2a[0][0]              
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 6, 6, 128)    147584      activation_13[0][0]              
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 6, 6, 128)    512         res3b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 6, 6, 128)    0           bn3b_branch2b[0][0]              
__________________________________________________________________________________________________
res3b_branch2c (Conv2D)         (None, 6, 6, 512)    66048       activation_14[0][0]              
__________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizati (None, 6, 6, 512)    2048        res3b_branch2c[0][0]             
__________________________________________________________________________________________________
add_4 (Add)                     (None, 6, 6, 512)    0           bn3b_branch2c[0][0]              
                                                                 activation_12[0][0]              
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 6, 6, 512)    0           add_4[0][0]                      
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 6, 6, 128)    65664       activation_15[0][0]              
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 6, 6, 128)    512         res3c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 6, 6, 128)    0           bn3c_branch2a[0][0]              
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 6, 6, 128)    147584      activation_16[0][0]              
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 6, 6, 128)    512         res3c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 6, 6, 128)    0           bn3c_branch2b[0][0]              
__________________________________________________________________________________________________
res3c_branch2c (Conv2D)         (None, 6, 6, 512)    66048       activation_17[0][0]              
__________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizati (None, 6, 6, 512)    2048        res3c_branch2c[0][0]             
__________________________________________________________________________________________________
add_5 (Add)                     (None, 6, 6, 512)    0           bn3c_branch2c[0][0]              
                                                                 activation_15[0][0]              
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 6, 6, 512)    0           add_5[0][0]                      
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 512)          0           activation_18[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512)          0           global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense (Dense)                   (None, 512)          262656      dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          262656      dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 512)          262656      dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 215)          110295      dense_2[0][0]                    
==================================================================================================
Total params: 2,069,719
Trainable params: 2,061,143
Non-trainable params: 8,576
__________________________________________________________________________________________________
Epoch 1/128
2408/2408 [==============================] - 31s 13ms/step - loss: 3.1745 - accuracy: 0.2407 - val_loss: 2.9161 - val_accuracy: 0.2893
Epoch 2/128
2408/2408 [==============================] - 29s 12ms/step - loss: 2.4397 - accuracy: 0.3814 - val_loss: 2.4320 - val_accuracy: 0.3885
Epoch 3/128
2408/2408 [==============================] - 30s 12ms/step - loss: 2.1566 - accuracy: 0.4426 - val_loss: 2.2641 - val_accuracy: 0.4333
Epoch 4/128
2408/2408 [==============================] - 30s 12ms/step - loss: 1.9859 - accuracy: 0.4828 - val_loss: 2.1058 - val_accuracy: 0.4667
Epoch 5/128
2408/2408 [==============================] - 30s 12ms/step - loss: 1.8610 - accuracy: 0.5106 - val_loss: 2.2457 - val_accuracy: 0.4451
Epoch 6/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.7479 - accuracy: 0.5372 - val_loss: 2.0181 - val_accuracy: 0.4939
Epoch 7/128
2408/2408 [==============================] - 30s 12ms/step - loss: 1.6510 - accuracy: 0.5616 - val_loss: 1.9922 - val_accuracy: 0.5040
Epoch 8/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.5687 - accuracy: 0.5787 - val_loss: 2.0041 - val_accuracy: 0.5032
Epoch 9/128
2408/2408 [==============================] - 30s 12ms/step - loss: 1.4784 - accuracy: 0.5979 - val_loss: 1.9527 - val_accuracy: 0.5102
Epoch 10/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.3982 - accuracy: 0.6173 - val_loss: 2.0035 - val_accuracy: 0.5118
Epoch 11/128
2408/2408 [==============================] - 30s 12ms/step - loss: 1.3213 - accuracy: 0.6342 - val_loss: 2.0489 - val_accuracy: 0.5092
Epoch 12/128
2408/2408 [==============================] - 30s 12ms/step - loss: 1.2447 - accuracy: 0.6531 - val_loss: 2.0175 - val_accuracy: 0.5310
Epoch 13/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.1719 - accuracy: 0.6719 - val_loss: 2.0286 - val_accuracy: 0.5282
Epoch 14/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.0961 - accuracy: 0.6891 - val_loss: 2.1012 - val_accuracy: 0.5239
Epoch 15/128
2408/2408 [==============================] - 29s 12ms/step - loss: 0.7892 - accuracy: 0.7734 - val_loss: 2.0476 - val_accuracy: 0.5574
Epoch 16/128
2408/2408 [==============================] - 30s 12ms/step - loss: 0.6815 - accuracy: 0.8024 - val_loss: 2.1439 - val_accuracy: 0.5544
Epoch 17/128
2408/2408 [==============================] - 29s 12ms/step - loss: 0.6220 - accuracy: 0.8197 - val_loss: 2.2430 - val_accuracy: 0.5508
Epoch 18/128
2408/2408 [==============================] - 29s 12ms/step - loss: 0.5737 - accuracy: 0.8327 - val_loss: 2.3521 - val_accuracy: 0.5469
Epoch 19/128
2408/2408 [==============================] - 29s 12ms/step - loss: 0.5346 - accuracy: 0.8433 - val_loss: 2.4555 - val_accuracy: 0.5455
689/689 [==============================] - 3s 4ms/step - loss: 1.9633 - accuracy: 0.5154
test loss, test acc: [1.963274598121643, 0.5153936743736267]

x_test shape: (22022, 50, 50, 1)
symbol names: ['1' '10' '14' '1½' '2' '20' '23' '3' '30' '4' '40' '5' '50' '6' '60' '7'
 '70' '8' '80' '9' '90' 'A' 'AB' 'AD' 'AG' 'AH' 'AK' 'AM' 'AN' 'ANŠE'
 'ANŠE.KUR.RA' 'AP' 'APIN' 'AT' 'AZ' 'AŠ' 'BA' 'BABBAR' 'BAD' 'BAK' 'BAN'
 'BAP' 'BAR' 'BAT' 'BE' 'BU' 'DA' 'DAŠ' 'DIN' 'DIŠ' 'DU' 'DUMU' 'E' 'EL'
 'EN' 'EŠŠANA' 'GAL' 'GEŠ' 'GEŠTIN' 'GI' 'GIG' 'GIR' 'GIŠ' 'GI₄' 'GUD'
 'GURUŠ' 'HA' 'HAL' 'HALAN' 'HAR' 'HI' 'HU' 'I' 'IA' 'IB' 'ID' 'IH' 'IK'
 'IM' 'IN' 'IP' 'IR' 'IS' 'IT' 'ITI' 'IZ' 'IŠ' 'KAK' 'KAM' 'KAP₀' 'KAR'
 'KASKAL' 'KAT₇' 'KAZ₀' 'KAŠ' 'KA₄' 'KI' 'KI+MIN' 'KIN' 'KU' 'KUR' 'KUT'
 'KUŠ' 'KÁN' 'KÙ' 'KÚM' 'LA' 'LAK' 'LI' 'LU' 'LÚ' 'MA' 'MAK₀' 'MAN' 'MAR'
 'MAS' 'MAZ₀' 'MAŠ' 'ME' 'MEŠ' 'MI' 'MIN' 'MU' 'MUZ₀' 'MUŠ' 'MUŠEN' 'MÍN'
 'NA' 'NAP' 'NI' 'NU' 'NUMUN' 'NÍTA' 'PA' 'PAN' 'PAP' 'PI' 'PU' 'PÁR'
 'PÍR' 'QA' 'RA' 'RAD' 'RAK₀' 'RAT' 'RI' 'RU' 'RÁB' 'RÁP' 'RÁŠ' 'SA' 'SAL'
 'SI' 'SU' 'TA' 'TAB' 'TAK' 'TAL' 'TAM₅' 'TAM₆' 'TAN' 'TAP' 'TAR' 'TAŠ'
 'TE' 'TI' 'TIN' 'TU' 'TUB' 'TUK' 'TUP' 'TUR' 'TU₄' 'U' 'UD' 'UDU' 'UG'
 'UH' 'UK' 'UL' 'UM' 'UN' 'UR' 'UT' 'ZA' 'ZAB' 'ZAP' 'ZI' 'ZIB' 'ZIK'
 'ZIK₀' 'ZIL₀' 'ZIP' 'ZIR₀' 'ZÍ' 'ZÍD' '½' 'ÁŠ' 'Ì' 'ÍB' 'ÍP' 'Ú' 'ŠAB₀'
 'ŠAP₀' 'ŠAR' 'ŠE' 'ŠI' 'ŠIB₀' 'ŠIR₈' 'ŠU' 'ŠÀ' 'ŠÁ' 'ḪAR' '⅓' '⅔']

Top 5 accuracy:
0.7858051039869222

              precision    recall  f1-score   support

           1       0.50      0.83      0.63       557
          10       0.62      0.56      0.59       203
          14       0.00      0.00      0.00         1
           2       0.53      0.66      0.59       400
          20       0.72      0.65      0.68       308
          23       0.00      0.00      0.00         1
           3       0.49      0.79      0.60       313
          30       0.56      0.51      0.54        68
           4       0.48      0.42      0.45       177
          40       0.52      0.36      0.42        45
           5       0.39      0.41      0.40       135
          50       0.76      0.40      0.52        40
           6       0.46      0.54      0.50       124
          60       0.00      0.00      0.00        32
           7       0.42      0.18      0.25        73
          70       0.47      0.32      0.38        22
           8       0.40      0.46      0.43        89
          80       0.80      0.20      0.32        20
           9       0.48      0.63      0.55        76
          90       0.33      0.29      0.31        17
           A       0.41      0.42      0.41       114
          AB       0.18      0.15      0.17        13
          AD       0.00      0.00      0.00        12
          AG       0.00      0.00      0.00         1
          AK       0.48      0.50      0.49       194
          AM       0.55      0.32      0.40        19
          AN       0.62      0.55      0.58       666
        ANŠE       0.20      0.75      0.32        12
          AP       0.35      0.28      0.31        64
        APIN       0.00      0.00      0.00         1
          AT       0.00      0.00      0.00        19
          AŠ       0.66      0.66      0.66       528
          BA       0.36      0.65      0.46       354
      BABBAR       0.00      0.00      0.00         1
         BAN       0.00      0.00      0.00         2
         BAP       0.00      0.00      0.00         5
         BAR       0.32      0.30      0.31       171
         BAT       0.00      0.00      0.00        20
          BE       0.72      0.47      0.57       325
          DA       0.52      0.52      0.52       601
         DAŠ       0.00      0.00      0.00         1
         DIN       0.00      0.00      0.00         1
         DIŠ       0.00      0.00      0.00         6
          DU       0.60      0.41      0.49       570
           E       0.14      0.04      0.06        24
          EL       0.00      0.00      0.00         2
          EN       0.00      0.00      0.00         6
      EŠŠANA       0.35      0.43      0.38        63
         GAL       0.43      0.49      0.46       178
         GEŠ       0.00      0.00      0.00         1
      GEŠTIN       0.23      0.20      0.21        41
          GI       0.28      0.32      0.30        37
         GIG       0.00      0.00      0.00         1
         GIŠ       0.38      0.34      0.35       107
         GUD       0.20      0.33      0.25         3
       GURUŠ       0.00      0.00      0.00         8
          HA       0.52      0.57      0.54       195
         HAL       0.75      0.69      0.72      1347
       HALAN       0.00      0.00      0.00         1
         HAR       0.46      0.55      0.50        20
          HI       0.39      0.61      0.47       133
          HU       0.60      0.41      0.49       223
           I       0.18      0.21      0.19        14
          IA       0.53      0.59      0.56       256
          IB       0.00      0.00      0.00        26
          ID       0.60      0.50      0.55         6
          IH       0.00      0.00      0.00         1
          IK       0.45      0.29      0.35        66
          IN       0.41      0.39      0.40        36
          IP       0.47      0.58      0.52       141
          IR       0.59      0.42      0.49       142
          IS       0.00      0.00      0.00         5
          IT       0.00      0.00      0.00         2
         ITI       0.48      0.59      0.53       261
          IZ       0.26      0.08      0.12       106
          IŠ       0.61      0.54      0.57       832
         KAK       1.00      0.20      0.33         5
         KAM       0.50      0.12      0.20         8
        KAP₀       0.00      0.00      0.00         7
         KAR       0.35      0.63      0.45        49
      KASKAL       0.00      0.00      0.00         3
        KAT₇       0.00      0.00      0.00         3
        KAZ₀       0.00      0.00      0.00         3
         KAŠ       0.59      0.28      0.38        57
         KA₄       0.46      0.47      0.46       493
          KI       0.50      0.74      0.59       370
         KIN       0.00      0.00      0.00         3
          KU       0.30      0.56      0.39       170
         KUR       0.59      0.53      0.56       415
         KUŠ       0.00      0.00      0.00         4
         KÁN       0.32      0.45      0.37        42
          KÙ       0.00      0.00      0.00         1
         KÚM       0.00      0.00      0.00         2
          LA       0.39      0.26      0.31        47
          LI       0.22      0.15      0.18        91
          LU       0.22      0.13      0.16        38
          LÚ       0.53      0.42      0.47       129
          MA       0.57      0.79      0.66       580
        MAK₀       0.00      0.00      0.00         4
         MAN       0.55      0.58      0.56       219
         MAR       0.71      0.23      0.35       154
         MAS       0.00      0.00      0.00         2
        MAZ₀       0.33      0.12      0.17        17
         MAŠ       0.00      0.00      0.00        22
          ME       0.56      0.56      0.56       348
         MEŠ       0.61      0.62      0.62       835
          MI       0.47      0.61      0.53       211
         MIN       0.42      0.12      0.19       233
          MU       0.25      0.16      0.20        49
        MUZ₀       0.00      0.00      0.00         7
       MUŠEN       0.00      0.00      0.00         3
         MÍN       0.38      0.25      0.31       197
          NA       0.49      0.67      0.57      1573
          NI       0.20      0.05      0.08        38
          NU       0.74      0.20      0.31       125
       NUMUN       0.33      0.14      0.20         7
        NÍTA       0.33      0.07      0.11        15
          PA       0.28      0.09      0.14        74
         PAN       0.14      0.14      0.14         7
         PAP       0.62      0.46      0.53       123
          PI       0.42      0.37      0.40        91
          PU       0.53      0.36      0.43       151
         PÁR       0.25      0.15      0.19        47
         PÍR       0.31      0.10      0.15        49
          QA       0.19      0.02      0.03       215
          RA       0.63      0.56      0.59       387
        RAK₀       1.00      0.25      0.40        16
          RI       0.58      0.56      0.57       170
          RU       0.53      0.18      0.27        45
         RÁB       0.00      0.00      0.00         8
         RÁP       0.00      0.00      0.00         5
         RÁŠ       0.00      0.00      0.00        47
          SA       0.46      0.51      0.49        68
         SAL       0.40      0.40      0.40       301
          SI       0.00      0.00      0.00         3
          SU       0.26      0.30      0.28        20
         TAB       0.00      0.00      0.00         3
         TAK       0.00      0.00      0.00         1
         TAL       0.00      0.00      0.00        12
        TAM₅       0.33      0.11      0.17        18
        TAM₆       0.00      0.00      0.00         2
         TAN       0.14      0.21      0.17        57
         TAP       0.00      0.00      0.00         3
         TAR       0.53      0.22      0.31        37
         TAŠ       0.44      0.63      0.52       175
          TE       0.39      0.30      0.34        46
          TI       0.63      0.67      0.65       218
         TIN       0.00      0.00      0.00        14
          TU       0.19      0.46      0.27        57
         TUK       0.00      0.00      0.00        30
         TUP       0.36      0.25      0.30        16
         TUR       0.30      0.30      0.30        44
         TU₄       0.06      0.11      0.08         9
           U       0.21      0.05      0.08        60
          UD       0.00      0.00      0.00        54
         UDU       0.25      0.05      0.08        22
          UG       0.00      0.00      0.00         6
          UK       0.39      0.39      0.39        31
          UL       0.55      0.65      0.59       274
          UM       0.51      0.45      0.47       202
          UN       0.61      0.39      0.48       142
          UR       0.00      0.00      0.00         7
          UT       0.24      0.09      0.13        76
          ZA       0.33      0.53      0.40        94
         ZAP       0.00      0.00      0.00         6
         ZIK       0.00      0.00      0.00         1
        ZIK₀       0.00      0.00      0.00         1
        ZIR₀       0.43      0.18      0.25        17
          ZÍ       0.41      0.63      0.49       113
         ZÍD       0.19      0.03      0.06        89
           ½       0.43      0.43      0.43       141
          ÁŠ       0.00      0.00      0.00        28
           Ì       0.00      0.00      0.00         6
          ÍB       0.00      0.00      0.00         1
          ÍP       0.00      0.00      0.00         4
           Ú       0.29      0.08      0.12        51
         ŠAR       0.00      0.00      0.00         1
          ŠE       0.47      0.41      0.44       242
          ŠI       0.49      0.49      0.49        93
        ŠIR₈       0.00      0.00      0.00         1
          ŠU       0.32      0.09      0.14        88
          ŠÀ       0.00      0.00      0.00         8
          ŠÁ       0.48      0.54      0.51       330

    accuracy                           0.52     22022
   macro avg       0.29      0.26      0.26     22022
weighted avg       0.51      0.52      0.50     22022