x_train shape: (77073, 50, 50, 1)
y_train shape: (77073,)
Number of images in x_train 77073
Number of images in x_valid 11011
Number of images in x_test 22022
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 50, 50, 1)]  0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 50, 50, 1)    0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 22, 22, 64)   3200        dropout[0][0]                    
__________________________________________________________________________________________________
bn_conv1 (BatchNormalization)   (None, 22, 22, 64)   256         conv1[0][0]                      
__________________________________________________________________________________________________
activation (Activation)         (None, 22, 22, 64)   0           bn_conv1[0][0]                   
__________________________________________________________________________________________________
pool1_pad (ZeroPadding2D)       (None, 24, 24, 64)   0           activation[0][0]                 
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 11, 11, 64)   0           pool1_pad[0][0]                  
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 11, 11, 64)   4160        max_pooling2d[0][0]              
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 11, 11, 64)   256         res2a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 11, 11, 64)   0           bn2a_branch2a[0][0]              
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 11, 11, 64)   36928       activation_1[0][0]               
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 11, 11, 64)   256         res2a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 11, 11, 64)   0           bn2a_branch2b[0][0]              
__________________________________________________________________________________________________
res2a_branch2c (Conv2D)         (None, 11, 11, 256)  16640       activation_2[0][0]               
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, 11, 11, 256)  16640       max_pooling2d[0][0]              
__________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizati (None, 11, 11, 256)  1024        res2a_branch2c[0][0]             
__________________________________________________________________________________________________
bn2a_branch1 (BatchNormalizatio (None, 11, 11, 256)  1024        res2a_branch1[0][0]              
__________________________________________________________________________________________________
add (Add)                       (None, 11, 11, 256)  0           bn2a_branch2c[0][0]              
																	bn2a_branch1[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 11, 11, 256)  0           add[0][0]                        
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 11, 11, 64)   16448       activation_3[0][0]               
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 11, 11, 64)   256         res2b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 11, 11, 64)   0           bn2b_branch2a[0][0]              
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 11, 11, 64)   36928       activation_4[0][0]               
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 11, 11, 64)   256         res2b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 11, 11, 64)   0           bn2b_branch2b[0][0]              
__________________________________________________________________________________________________
res2b_branch2c (Conv2D)         (None, 11, 11, 256)  16640       activation_5[0][0]               
__________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizati (None, 11, 11, 256)  1024        res2b_branch2c[0][0]             
__________________________________________________________________________________________________
add_1 (Add)                     (None, 11, 11, 256)  0           bn2b_branch2c[0][0]              
																	activation_3[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 11, 11, 256)  0           add_1[0][0]                      
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 11, 11, 64)   16448       activation_6[0][0]               
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 11, 11, 64)   256         res2c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 11, 11, 64)   0           bn2c_branch2a[0][0]              
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 11, 11, 64)   36928       activation_7[0][0]               
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 11, 11, 64)   256         res2c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 11, 11, 64)   0           bn2c_branch2b[0][0]              
__________________________________________________________________________________________________
res2c_branch2c (Conv2D)         (None, 11, 11, 256)  16640       activation_8[0][0]               
__________________________________________________________________________________________________
bn2c_branch2c (BatchNormalizati (None, 11, 11, 256)  1024        res2c_branch2c[0][0]             
__________________________________________________________________________________________________
add_2 (Add)                     (None, 11, 11, 256)  0           bn2c_branch2c[0][0]              
																	activation_6[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 11, 11, 256)  0           add_2[0][0]                      
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 6, 6, 128)    32896       activation_9[0][0]               
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 6, 6, 128)    512         res3a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 6, 6, 128)    0           bn3a_branch2a[0][0]              
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 6, 6, 128)    147584      activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 6, 6, 128)    512         res3a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 6, 6, 128)    0           bn3a_branch2b[0][0]              
__________________________________________________________________________________________________
res3a_branch2c (Conv2D)         (None, 6, 6, 512)    66048       activation_11[0][0]              
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 6, 6, 512)    131584      activation_9[0][0]               
__________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizati (None, 6, 6, 512)    2048        res3a_branch2c[0][0]             
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 6, 6, 512)    2048        res3a_branch1[0][0]              
__________________________________________________________________________________________________
add_3 (Add)                     (None, 6, 6, 512)    0           bn3a_branch2c[0][0]              
																	bn3a_branch1[0][0]               
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 6, 6, 512)    0           add_3[0][0]                      
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 6, 6, 128)    65664       activation_12[0][0]              
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 6, 6, 128)    512         res3b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 6, 6, 128)    0           bn3b_branch2a[0][0]              
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 6, 6, 128)    147584      activation_13[0][0]              
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 6, 6, 128)    512         res3b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 6, 6, 128)    0           bn3b_branch2b[0][0]              
__________________________________________________________________________________________________
res3b_branch2c (Conv2D)         (None, 6, 6, 512)    66048       activation_14[0][0]              
__________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizati (None, 6, 6, 512)    2048        res3b_branch2c[0][0]             
__________________________________________________________________________________________________
add_4 (Add)                     (None, 6, 6, 512)    0           bn3b_branch2c[0][0]              
																	activation_12[0][0]              
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 6, 6, 512)    0           add_4[0][0]                      
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 6, 6, 128)    65664       activation_15[0][0]              
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 6, 6, 128)    512         res3c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 6, 6, 128)    0           bn3c_branch2a[0][0]              
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 6, 6, 128)    147584      activation_16[0][0]              
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 6, 6, 128)    512         res3c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 6, 6, 128)    0           bn3c_branch2b[0][0]              
__________________________________________________________________________________________________
res3c_branch2c (Conv2D)         (None, 6, 6, 512)    66048       activation_17[0][0]              
__________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizati (None, 6, 6, 512)    2048        res3c_branch2c[0][0]             
__________________________________________________________________________________________________
add_5 (Add)                     (None, 6, 6, 512)    0           bn3c_branch2c[0][0]              
																	activation_15[0][0]              
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 6, 6, 512)    0           add_5[0][0]                      
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 512)          0           activation_18[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512)          0           global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense (Dense)                   (None, 512)          262656      dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          262656      dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 512)          262656      dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 215)          110295      dense_2[0][0]                    
==================================================================================================
Total params: 2,069,719
Trainable params: 2,061,143
Non-trainable params: 8,576
__________________________________________________________________________________________________
Epoch 1/128
2408/2408 [==============================] - 85s 35ms/step - loss: 3.3064 - accuracy: 0.2195 - val_loss: 3.1145 - val_accuracy: 0.2667 - lr: 0.0010
Epoch 2/128
2408/2408 [==============================] - 84s 35ms/step - loss: 2.6159 - accuracy: 0.3429 - val_loss: 2.5755 - val_accuracy: 0.3629 - lr: 0.0010
Epoch 3/128
2408/2408 [==============================] - 83s 35ms/step - loss: 2.3229 - accuracy: 0.4062 - val_loss: 2.4347 - val_accuracy: 0.3981 - lr: 0.0010
Epoch 4/128
2408/2408 [==============================] - 83s 35ms/step - loss: 2.1477 - accuracy: 0.4457 - val_loss: 2.1658 - val_accuracy: 0.4582 - lr: 0.0010
Epoch 5/128
2408/2408 [==============================] - 83s 35ms/step - loss: 2.0152 - accuracy: 0.4785 - val_loss: 2.0741 - val_accuracy: 0.4773 - lr: 0.0010
Epoch 6/128
2408/2408 [==============================] - 83s 35ms/step - loss: 1.9049 - accuracy: 0.5030 - val_loss: 2.1414 - val_accuracy: 0.4610 - lr: 0.0010
Epoch 7/128
2408/2408 [==============================] - 83s 34ms/step - loss: 1.8111 - accuracy: 0.5258 - val_loss: 2.0973 - val_accuracy: 0.4822 - lr: 0.0010
Epoch 8/128
2408/2408 [==============================] - 83s 35ms/step - loss: 1.7258 - accuracy: 0.5461 - val_loss: 2.0068 - val_accuracy: 0.5000 - lr: 0.0010
Epoch 9/128
2408/2408 [==============================] - 83s 35ms/step - loss: 1.6494 - accuracy: 0.5624 - val_loss: 1.9896 - val_accuracy: 0.5018 - lr: 0.0010
Epoch 10/128
2408/2408 [==============================] - 83s 35ms/step - loss: 1.5791 - accuracy: 0.5786 - val_loss: 1.9804 - val_accuracy: 0.5139 - lr: 0.0010
Epoch 11/128
2408/2408 [==============================] - 83s 35ms/step - loss: 1.5097 - accuracy: 0.5939 - val_loss: 2.0177 - val_accuracy: 0.5031 - lr: 0.0010
Epoch 12/128
2408/2408 [==============================] - 83s 34ms/step - loss: 1.4495 - accuracy: 0.6083 - val_loss: 1.9620 - val_accuracy: 0.5201 - lr: 0.0010
Epoch 13/128
2408/2408 [==============================] - 82s 34ms/step - loss: 1.3840 - accuracy: 0.6242 - val_loss: 2.0027 - val_accuracy: 0.5218 - lr: 0.0010
Epoch 14/128
2408/2408 [==============================] - 82s 34ms/step - loss: 1.3290 - accuracy: 0.6361 - val_loss: 2.0160 - val_accuracy: 0.5220 - lr: 0.0010
Epoch 15/128
2408/2408 [==============================] - 83s 34ms/step - loss: 1.2725 - accuracy: 0.6491 - val_loss: 2.1478 - val_accuracy: 0.5195 - lr: 0.0010
Epoch 16/128
2408/2408 [==============================] - 83s 35ms/step - loss: 1.2245 - accuracy: 0.6600 - val_loss: 2.1315 - val_accuracy: 0.5112 - lr: 0.0010
Epoch 17/128
2408/2408 [==============================] - 83s 35ms/step - loss: 1.1777 - accuracy: 0.6734 - val_loss: 2.2107 - val_accuracy: 0.5261 - lr: 0.0010
Epoch 18/128
2408/2408 [==============================] - 83s 35ms/step - loss: 0.9119 - accuracy: 0.7397 - val_loss: 2.1032 - val_accuracy: 0.5513 - lr: 1.0000e-04
Epoch 19/128
2408/2408 [==============================] - 83s 35ms/step - loss: 0.8130 - accuracy: 0.7648 - val_loss: 2.1655 - val_accuracy: 0.5493 - lr: 1.0000e-04
Epoch 20/128
2408/2408 [==============================] - 83s 34ms/step - loss: 0.7575 - accuracy: 0.7802 - val_loss: 2.2524 - val_accuracy: 0.5462 - lr: 1.0000e-04
Epoch 21/128
2408/2408 [==============================] - 84s 35ms/step - loss: 0.7187 - accuracy: 0.7901 - val_loss: 2.3318 - val_accuracy: 0.5464 - lr: 1.0000e-04
Epoch 22/128
2408/2408 [==============================] - 83s 35ms/step - loss: 0.6809 - accuracy: 0.7984 - val_loss: 2.3464 - val_accuracy: 0.5449 - lr: 1.0000e-04
689/689 [==============================] - 7s 10ms/step - loss: 1.9644 - accuracy: 0.5198
test loss, test acc: [1.9644370079040527, 0.5198438167572021]

x_test shape: (22022, 50, 50, 1)
symbol names: ['1' '10' '14' '1½' '2' '20' '23' '3' '30' '4' '40' '5' '50' '6' '60' '7'
 '70' '8' '80' '9' '90' 'A' 'AB' 'AD' 'AG' 'AH' 'AK' 'AM' 'AN' 'ANŠE'
 'ANŠE.KUR.RA' 'AP' 'APIN' 'AT' 'AZ' 'AŠ' 'BA' 'BABBAR' 'BAD' 'BAK' 'BAN'
 'BAP' 'BAR' 'BAT' 'BE' 'BU' 'DA' 'DAŠ' 'DIN' 'DIŠ' 'DU' 'DUMU' 'E' 'EL'
 'EN' 'EŠŠANA' 'GAL' 'GEŠ' 'GEŠTIN' 'GI' 'GIG' 'GIR' 'GIŠ' 'GI₄' 'GUD'
 'GURUŠ' 'HA' 'HAL' 'HALAN' 'HAR' 'HI' 'HU' 'I' 'IA' 'IB' 'ID' 'IH' 'IK'
 'IM' 'IN' 'IP' 'IR' 'IS' 'IT' 'ITI' 'IZ' 'IŠ' 'KAK' 'KAM' 'KAP₀' 'KAR'
 'KASKAL' 'KAT₇' 'KAZ₀' 'KAŠ' 'KA₄' 'KI' 'KI+MIN' 'KIN' 'KU' 'KUR' 'KUT'
 'KUŠ' 'KÁN' 'KÙ' 'KÚM' 'LA' 'LAK' 'LI' 'LU' 'LÚ' 'MA' 'MAK₀' 'MAN' 'MAR'
 'MAS' 'MAZ₀' 'MAŠ' 'ME' 'MEŠ' 'MI' 'MIN' 'MU' 'MUZ₀' 'MUŠ' 'MUŠEN' 'MÍN'
 'NA' 'NAP' 'NI' 'NU' 'NUMUN' 'NÍTA' 'PA' 'PAN' 'PAP' 'PI' 'PU' 'PÁR'
 'PÍR' 'QA' 'RA' 'RAD' 'RAK₀' 'RAT' 'RI' 'RU' 'RÁB' 'RÁP' 'RÁŠ' 'SA' 'SAL'
 'SI' 'SU' 'TA' 'TAB' 'TAK' 'TAL' 'TAM₅' 'TAM₆' 'TAN' 'TAP' 'TAR' 'TAŠ'
 'TE' 'TI' 'TIN' 'TU' 'TUB' 'TUK' 'TUP' 'TUR' 'TU₄' 'U' 'UD' 'UDU' 'UG'
 'UH' 'UK' 'UL' 'UM' 'UN' 'UR' 'UT' 'ZA' 'ZAB' 'ZAP' 'ZI' 'ZIB' 'ZIK'
 'ZIK₀' 'ZIL₀' 'ZIP' 'ZIR₀' 'ZÍ' 'ZÍD' '½' 'ÁŠ' 'Ì' 'ÍB' 'ÍP' 'Ú' 'ŠAB₀'
 'ŠAP₀' 'ŠAR' 'ŠE' 'ŠI' 'ŠIB₀' 'ŠIR₈' 'ŠU' 'ŠÀ' 'ŠÁ' 'ḪAR' '⅓' '⅔']
Top 5 accuracy:
0.7887566978476069

              precision    recall  f1-score   support

           1       0.52      0.68      0.59       527
          10       0.55      0.77      0.64       193
          14       0.00      0.00      0.00         1
           2       0.56      0.56      0.56       383
          20       0.64      0.73      0.68       280
           3       0.59      0.70      0.64       307
          30       0.70      0.57      0.63        84
           4       0.54      0.48      0.51       180
          40       0.53      0.57      0.55        49
           5       0.45      0.40      0.42       134
          50       0.59      0.43      0.50        37
           6       0.38      0.51      0.44       111
          60       0.00      0.00      0.00        39
           7       0.28      0.23      0.26        77
          70       0.45      0.33      0.38        27
           8       0.30      0.51      0.37        93
          80       0.38      0.33      0.35        18
           9       0.40      0.61      0.49        84
          90       0.67      0.17      0.28        23
           A       0.47      0.36      0.41       113
          AB       0.00      0.00      0.00        16
          AD       0.10      0.06      0.08        16
          AH       0.00      0.00      0.00         3
          AK       0.49      0.37      0.42       182
          AM       0.56      0.33      0.42        15
          AN       0.72      0.51      0.60       703
        ANŠE       0.35      0.75      0.48         8
 ANŠE.KUR.RA       0.00      0.00      0.00         1
          AP       0.26      0.28      0.27        64
          AT       0.00      0.00      0.00        14
          AŠ       0.55      0.71      0.62       486
          BA       0.39      0.52      0.45       405
         BAD       0.00      0.00      0.00         2
         BAN       0.00      0.00      0.00         4
         BAR       0.52      0.25      0.34       183
         BAT       0.00      0.00      0.00        19
          BE       0.53      0.59      0.56       331
          BU       0.00      0.00      0.00         1
          DA       0.53      0.57      0.55       617
         DAŠ       0.00      0.00      0.00         2
         DIŠ       0.00      0.00      0.00         6
          DU       0.54      0.47      0.50       515
        DUMU       0.00      0.00      0.00         1
           E       0.00      0.00      0.00        24
          EL       0.00      0.00      0.00         1
          EN       0.00      0.00      0.00         2
      EŠŠANA       0.54      0.37      0.44        52
         GAL       0.59      0.46      0.52       179
      GEŠTIN       0.35      0.16      0.22        43
          GI       0.27      0.38      0.32        42
         GIG       0.00      0.00      0.00         1
         GIŠ       0.31      0.23      0.27       111
         GUD       0.00      0.00      0.00         3
       GURUŠ       0.00      0.00      0.00         5
          HA       0.56      0.46      0.51       205
         HAL       0.77      0.69      0.73      1292
         HAR       0.73      0.38      0.50        21
          HI       0.54      0.50      0.52       126
          HU       0.64      0.56      0.60       230
           I       0.00      0.00      0.00        11
          IA       0.44      0.66      0.53       256
          IB       0.00      0.00      0.00        23
          ID       0.00      0.00      0.00         3
          IK       0.53      0.27      0.36        71
          IM       0.00      0.00      0.00         1
          IN       0.20      0.50      0.29        32
          IP       0.56      0.64      0.60       154
          IR       0.66      0.45      0.53       145
          IS       0.00      0.00      0.00         6
         ITI       0.58      0.52      0.55       259
          IZ       0.24      0.04      0.08       112
          IŠ       0.52      0.59      0.55       820
         KAK       0.00      0.00      0.00         4
         KAM       0.00      0.00      0.00         9
        KAP₀       0.00      0.00      0.00         9
         KAR       0.53      0.57      0.55        46
        KAT₇       0.00      0.00      0.00         1
        KAZ₀       0.00      0.00      0.00         2
         KAŠ       0.28      0.09      0.14        53
         KA₄       0.45      0.49      0.47       478
          KI       0.54      0.77      0.64       382
         KIN       0.00      0.00      0.00         2
          KU       0.38      0.50      0.43       178
         KUR       0.53      0.52      0.52       442
         KUŠ       0.00      0.00      0.00         3
         KÁN       0.44      0.10      0.16        41
          KÙ       0.00      0.00      0.00         2
         KÚM       0.67      0.67      0.67         3
          LA       0.20      0.08      0.12        36
          LI       0.49      0.25      0.33       101
          LU       0.37      0.20      0.26        51
          LÚ       0.41      0.35      0.38       117
          MA       0.63      0.77      0.69       626
        MAK₀       0.00      0.00      0.00         5
         MAN       0.55      0.58      0.57       212
         MAR       0.51      0.42      0.46       171
         MAS       0.00      0.00      0.00         5
        MAZ₀       0.71      0.38      0.50        13
         MAŠ       0.00      0.00      0.00        27
          ME       0.59      0.56      0.57       334
         MEŠ       0.59      0.66      0.63       805
          MI       0.51      0.60      0.55       200
         MIN       0.38      0.30      0.34       231
          MU       0.33      0.16      0.21        45
        MUZ₀       1.00      0.50      0.67         2
       MUŠEN       0.00      0.00      0.00         1
         MÍN       0.39      0.26      0.31       195
          NA       0.47      0.69      0.56      1578
          NI       0.37      0.38      0.37        40
          NU       0.70      0.43      0.53       134
       NUMUN       1.00      0.75      0.86         4
        NÍTA       0.00      0.00      0.00        26
          PA       0.25      0.03      0.05        72
         PAN       0.00      0.00      0.00         9
         PAP       0.41      0.45      0.43       104
          PI       0.47      0.18      0.27        92
          PU       0.36      0.52      0.42       172
         PÁR       0.20      0.04      0.06        56
         PÍR       0.29      0.38      0.33        21
          QA       0.23      0.01      0.03       218
          RA       0.64      0.54      0.59       378
        RAK₀       0.60      0.20      0.30        15
         RAT       0.00      0.00      0.00         1
          RI       0.63      0.50      0.56       176
          RU       0.40      0.42      0.41        48
         RÁB       0.00      0.00      0.00         6
         RÁP       0.00      0.00      0.00         7
         RÁŠ       0.41      0.21      0.28        57
          SA       0.68      0.38      0.49        71
         SAL       0.54      0.44      0.48       307
          SI       0.00      0.00      0.00         5
          SU       0.00      0.00      0.00        23
         TAB       0.00      0.00      0.00         4
         TAK       0.00      0.00      0.00         1
         TAL       0.00      0.00      0.00        12
        TAM₅       1.00      0.08      0.15        12
        TAM₆       0.00      0.00      0.00         3
         TAN       0.24      0.23      0.24        64
         TAP       0.00      0.00      0.00         5
         TAR       0.25      0.04      0.07        24
         TAŠ       0.62      0.57      0.60       172
          TE       0.61      0.41      0.49        27
          TI       0.72      0.53      0.61       209
         TIN       0.50      0.20      0.29        10
          TU       0.30      0.53      0.39        59
         TUK       0.14      0.04      0.06        28
         TUP       0.17      0.07      0.10        15
         TUR       0.34      0.56      0.42        55
         TU₄       1.00      0.22      0.36         9
           U       0.00      0.00      0.00        69
          UD       0.00      0.00      0.00        47
         UDU       0.06      0.07      0.07        14
          UG       0.00      0.00      0.00         7
          UK       0.52      0.35      0.42        37
          UL       0.70      0.60      0.64       290
          UM       0.57      0.35      0.43       184
          UN       0.38      0.38      0.38       131
          UR       0.00      0.00      0.00        12
          UT       0.18      0.03      0.06        90
          ZA       0.24      0.47      0.32       109
         ZAP       0.00      0.00      0.00         5
         ZIK       1.00      0.25      0.40         4
        ZIK₀       0.00      0.00      0.00         1
        ZIR₀       0.10      0.08      0.09        13
          ZÍ       0.43      0.57      0.49       117
         ZÍD       0.00      0.00      0.00        99
           ½       0.43      0.42      0.42       148
          ÁŠ       0.00      0.00      0.00        32
          ÍB       0.00      0.00      0.00         1
          ÍP       0.00      0.00      0.00         5
           Ú       0.50      0.23      0.32        65
        ŠAB₀       0.00      0.00      0.00         1
        ŠAP₀       0.00      0.00      0.00         0
         ŠAR       0.00      0.00      0.00         1
          ŠE       0.51      0.38      0.44       238
          ŠI       0.51      0.59      0.55        98
          ŠU       0.25      0.29      0.27        83
          ŠÀ       0.00      0.00      0.00         3
          ŠÁ       0.35      0.66      0.45       369
         ḪAR       0.00      0.00      0.00         2
           ⅓       0.00      0.00      0.00         1
           ⅔       0.00      0.00      0.00         1

    accuracy                           0.52     22022
   macro avg       0.31      0.26      0.27     22022
weighted avg       0.51      0.52      0.50     22022
