x_train shape: (77073, 50, 50, 1)
y_train shape: (77073,)
Number of images in x_train 77073
Number of images in x_valid 11011
Number of images in x_test 22022
Model: "functional_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 50, 50, 1)]  0                                            
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 50, 50, 1)    0           input_2[0][0]                    
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 22, 22, 64)   3200        dropout_2[0][0]                  
__________________________________________________________________________________________________
bn_conv1 (BatchNormalization)   (None, 22, 22, 64)   256         conv1[0][0]                      
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 22, 22, 64)   0           bn_conv1[0][0]                   
__________________________________________________________________________________________________
pool1_pad (ZeroPadding2D)       (None, 24, 24, 64)   0           activation_19[0][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 11, 11, 64)   0           pool1_pad[0][0]                  
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 11, 11, 64)   4160        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 11, 11, 64)   256         res2a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 11, 11, 64)   0           bn2a_branch2a[0][0]              
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 11, 11, 64)   36928       activation_20[0][0]              
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 11, 11, 64)   256         res2a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 11, 11, 64)   0           bn2a_branch2b[0][0]              
__________________________________________________________________________________________________
res2a_branch2c (Conv2D)         (None, 11, 11, 256)  16640       activation_21[0][0]              
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, 11, 11, 256)  16640       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizati (None, 11, 11, 256)  1024        res2a_branch2c[0][0]             
__________________________________________________________________________________________________
bn2a_branch1 (BatchNormalizatio (None, 11, 11, 256)  1024        res2a_branch1[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 11, 11, 256)  0           bn2a_branch2c[0][0]              
                                                                 bn2a_branch1[0][0]               
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 11, 11, 256)  0           add_6[0][0]                      
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 11, 11, 64)   16448       activation_22[0][0]              
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 11, 11, 64)   256         res2b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 11, 11, 64)   0           bn2b_branch2a[0][0]              
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 11, 11, 64)   36928       activation_23[0][0]              
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 11, 11, 64)   256         res2b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 11, 11, 64)   0           bn2b_branch2b[0][0]              
__________________________________________________________________________________________________
res2b_branch2c (Conv2D)         (None, 11, 11, 256)  16640       activation_24[0][0]              
__________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizati (None, 11, 11, 256)  1024        res2b_branch2c[0][0]             
__________________________________________________________________________________________________
add_7 (Add)                     (None, 11, 11, 256)  0           bn2b_branch2c[0][0]              
                                                                 activation_22[0][0]              
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 11, 11, 256)  0           add_7[0][0]                      
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 11, 11, 64)   16448       activation_25[0][0]              
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 11, 11, 64)   256         res2c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 11, 11, 64)   0           bn2c_branch2a[0][0]              
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 11, 11, 64)   36928       activation_26[0][0]              
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 11, 11, 64)   256         res2c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 11, 11, 64)   0           bn2c_branch2b[0][0]              
__________________________________________________________________________________________________
res2c_branch2c (Conv2D)         (None, 11, 11, 256)  16640       activation_27[0][0]              
__________________________________________________________________________________________________
bn2c_branch2c (BatchNormalizati (None, 11, 11, 256)  1024        res2c_branch2c[0][0]             
__________________________________________________________________________________________________
add_8 (Add)                     (None, 11, 11, 256)  0           bn2c_branch2c[0][0]              
                                                                 activation_25[0][0]              
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 11, 11, 256)  0           add_8[0][0]                      
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 6, 6, 128)    32896       activation_28[0][0]              
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 6, 6, 128)    512         res3a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 6, 6, 128)    0           bn3a_branch2a[0][0]              
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 6, 6, 128)    147584      activation_29[0][0]              
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 6, 6, 128)    512         res3a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 6, 6, 128)    0           bn3a_branch2b[0][0]              
__________________________________________________________________________________________________
res3a_branch2c (Conv2D)         (None, 6, 6, 512)    66048       activation_30[0][0]              
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 6, 6, 512)    131584      activation_28[0][0]              
__________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizati (None, 6, 6, 512)    2048        res3a_branch2c[0][0]             
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 6, 6, 512)    2048        res3a_branch1[0][0]              
__________________________________________________________________________________________________
add_9 (Add)                     (None, 6, 6, 512)    0           bn3a_branch2c[0][0]              
                                                                 bn3a_branch1[0][0]               
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 6, 6, 512)    0           add_9[0][0]                      
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 6, 6, 128)    65664       activation_31[0][0]              
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 6, 6, 128)    512         res3b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 6, 6, 128)    0           bn3b_branch2a[0][0]              
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 6, 6, 128)    147584      activation_32[0][0]              
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 6, 6, 128)    512         res3b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 6, 6, 128)    0           bn3b_branch2b[0][0]              
__________________________________________________________________________________________________
res3b_branch2c (Conv2D)         (None, 6, 6, 512)    66048       activation_33[0][0]              
__________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizati (None, 6, 6, 512)    2048        res3b_branch2c[0][0]             
__________________________________________________________________________________________________
add_10 (Add)                    (None, 6, 6, 512)    0           bn3b_branch2c[0][0]              
                                                                 activation_31[0][0]              
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 6, 6, 512)    0           add_10[0][0]                     
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 6, 6, 128)    65664       activation_34[0][0]              
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 6, 6, 128)    512         res3c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 6, 6, 128)    0           bn3c_branch2a[0][0]              
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 6, 6, 128)    147584      activation_35[0][0]              
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 6, 6, 128)    512         res3c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 6, 6, 128)    0           bn3c_branch2b[0][0]              
__________________________________________________________________________________________________
res3c_branch2c (Conv2D)         (None, 6, 6, 512)    66048       activation_36[0][0]              
__________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizati (None, 6, 6, 512)    2048        res3c_branch2c[0][0]             
__________________________________________________________________________________________________
add_11 (Add)                    (None, 6, 6, 512)    0           bn3c_branch2c[0][0]              
                                                                 activation_34[0][0]              
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 6, 6, 512)    0           add_11[0][0]                     
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 512)          0           activation_37[0][0]              
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 512)          0           global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 512)          262656      dropout_3[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 512)          262656      dense_4[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 512)          262656      dense_5[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 215)          110295      dense_6[0][0]                    
==================================================================================================
Total params: 2,069,719
Trainable params: 2,061,143
Non-trainable params: 8,576
__________________________________________________________________________________________________
Epoch 1/128
2408/2408 [==============================] - 30s 12ms/step - loss: 3.1148 - accuracy: 0.2517 - val_loss: 2.8591 - val_accuracy: 0.2977
Epoch 2/128
2408/2408 [==============================] - 29s 12ms/step - loss: 2.4247 - accuracy: 0.3823 - val_loss: 2.4912 - val_accuracy: 0.3708
Epoch 3/128
2408/2408 [==============================] - 29s 12ms/step - loss: 2.1512 - accuracy: 0.4455 - val_loss: 2.4966 - val_accuracy: 0.3919
Epoch 4/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.9834 - accuracy: 0.4821 - val_loss: 2.1090 - val_accuracy: 0.4611
Epoch 5/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.8544 - accuracy: 0.5111 - val_loss: 2.0395 - val_accuracy: 0.4848
Epoch 6/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.7414 - accuracy: 0.5385 - val_loss: 2.2242 - val_accuracy: 0.4457
Epoch 7/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.6444 - accuracy: 0.5603 - val_loss: 2.0486 - val_accuracy: 0.4922
Epoch 8/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.5554 - accuracy: 0.5809 - val_loss: 2.0183 - val_accuracy: 0.4963
Epoch 9/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.4768 - accuracy: 0.5996 - val_loss: 2.0223 - val_accuracy: 0.5007
Epoch 10/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.3950 - accuracy: 0.6187 - val_loss: 1.9375 - val_accuracy: 0.5214
Epoch 11/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.3225 - accuracy: 0.6353 - val_loss: 2.0688 - val_accuracy: 0.5104
Epoch 12/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.2417 - accuracy: 0.6532 - val_loss: 1.9440 - val_accuracy: 0.5342
Epoch 13/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.1663 - accuracy: 0.6729 - val_loss: 2.0087 - val_accuracy: 0.5266
Epoch 14/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.0967 - accuracy: 0.6913 - val_loss: 2.0353 - val_accuracy: 0.5369
Epoch 15/128
2408/2408 [==============================] - 29s 12ms/step - loss: 1.0353 - accuracy: 0.7041 - val_loss: 2.1556 - val_accuracy: 0.5184
Epoch 16/128
2408/2408 [==============================] - 29s 12ms/step - loss: 0.7305 - accuracy: 0.7892 - val_loss: 2.1538 - val_accuracy: 0.5634
Epoch 17/128
2408/2408 [==============================] - 29s 12ms/step - loss: 0.6192 - accuracy: 0.8197 - val_loss: 2.2886 - val_accuracy: 0.5537
Epoch 18/128
2408/2408 [==============================] - 29s 12ms/step - loss: 0.5613 - accuracy: 0.8356 - val_loss: 2.3737 - val_accuracy: 0.5516
Epoch 19/128
2408/2408 [==============================] - 29s 12ms/step - loss: 0.5137 - accuracy: 0.8495 - val_loss: 2.5167 - val_accuracy: 0.5447
Epoch 20/128
2408/2408 [==============================] - 29s 12ms/step - loss: 0.4732 - accuracy: 0.8603 - val_loss: 2.6341 - val_accuracy: 0.5422
689/689 [==============================] - 3s 4ms/step - loss: 1.9344 - accuracy: 0.5227
test loss, test acc: [1.9344327449798584, 0.522659182548523]

x_test shape: (22022, 50, 50, 1)
symbol names: ['1' '10' '14' '1½' '2' '20' '23' '3' '30' '4' '40' '5' '50' '6' '60' '7'
 '70' '8' '80' '9' '90' 'A' 'AB' 'AD' 'AG' 'AH' 'AK' 'AM' 'AN' 'ANŠE'
 'ANŠE.KUR.RA' 'AP' 'APIN' 'AT' 'AZ' 'AŠ' 'BA' 'BABBAR' 'BAD' 'BAK' 'BAN'
 'BAP' 'BAR' 'BAT' 'BE' 'BU' 'DA' 'DAŠ' 'DIN' 'DIŠ' 'DU' 'DUMU' 'E' 'EL'
 'EN' 'EŠŠANA' 'GAL' 'GEŠ' 'GEŠTIN' 'GI' 'GIG' 'GIR' 'GIŠ' 'GI₄' 'GUD'
 'GURUŠ' 'HA' 'HAL' 'HALAN' 'HAR' 'HI' 'HU' 'I' 'IA' 'IB' 'ID' 'IH' 'IK'
 'IM' 'IN' 'IP' 'IR' 'IS' 'IT' 'ITI' 'IZ' 'IŠ' 'KAK' 'KAM' 'KAP₀' 'KAR'
 'KASKAL' 'KAT₇' 'KAZ₀' 'KAŠ' 'KA₄' 'KI' 'KI+MIN' 'KIN' 'KU' 'KUR' 'KUT'
 'KUŠ' 'KÁN' 'KÙ' 'KÚM' 'LA' 'LAK' 'LI' 'LU' 'LÚ' 'MA' 'MAK₀' 'MAN' 'MAR'
 'MAS' 'MAZ₀' 'MAŠ' 'ME' 'MEŠ' 'MI' 'MIN' 'MU' 'MUZ₀' 'MUŠ' 'MUŠEN' 'MÍN'
 'NA' 'NAP' 'NI' 'NU' 'NUMUN' 'NÍTA' 'PA' 'PAN' 'PAP' 'PI' 'PU' 'PÁR'
 'PÍR' 'QA' 'RA' 'RAD' 'RAK₀' 'RAT' 'RI' 'RU' 'RÁB' 'RÁP' 'RÁŠ' 'SA' 'SAL'
 'SI' 'SU' 'TA' 'TAB' 'TAK' 'TAL' 'TAM₅' 'TAM₆' 'TAN' 'TAP' 'TAR' 'TAŠ'
 'TE' 'TI' 'TIN' 'TU' 'TUB' 'TUK' 'TUP' 'TUR' 'TU₄' 'U' 'UD' 'UDU' 'UG'
 'UH' 'UK' 'UL' 'UM' 'UN' 'UR' 'UT' 'ZA' 'ZAB' 'ZAP' 'ZI' 'ZIB' 'ZIK'
 'ZIK₀' 'ZIL₀' 'ZIP' 'ZIR₀' 'ZÍ' 'ZÍD' '½' 'ÁŠ' 'Ì' 'ÍB' 'ÍP' 'Ú' 'ŠAB₀'
 'ŠAP₀' 'ŠAR' 'ŠE' 'ŠI' 'ŠIB₀' 'ŠIR₈' 'ŠU' 'ŠÀ' 'ŠÁ' 'ḪAR' '⅓' '⅔']
Top 5 accuracy:
0.7920715647988376

              precision    recall  f1-score   support

           1       0.59      0.77      0.67       557
          10       0.63      0.65      0.64       203
          14       0.00      0.00      0.00         1
           2       0.56      0.66      0.61       400
          20       0.67      0.66      0.67       308
          23       0.00      0.00      0.00         1
           3       0.60      0.74      0.67       313
          30       0.55      0.53      0.54        68
           4       0.59      0.46      0.52       177
          40       0.55      0.38      0.45        45
           5       0.51      0.45      0.48       135
          50       0.52      0.42      0.47        40
           6       0.49      0.39      0.43       124
          60       0.00      0.00      0.00        32
           7       0.68      0.21      0.32        73
          70       0.36      0.23      0.28        22
           8       0.52      0.40      0.46        89
          80       0.25      0.10      0.14        20
           9       0.57      0.59      0.58        76
          90       0.19      0.41      0.26        17
           A       0.59      0.42      0.49       114
          AB       0.00      0.00      0.00        13
          AD       0.00      0.00      0.00        12
          AG       0.00      0.00      0.00         1
          AH       0.00      0.00      0.00         0
          AK       0.62      0.38      0.47       194
          AM       0.67      0.11      0.18        19
          AN       0.56      0.67      0.61       666
        ANŠE       0.47      0.58      0.52        12
          AP       0.18      0.47      0.26        64
        APIN       0.00      0.00      0.00         1
          AT       0.00      0.00      0.00        19
          AŠ       0.75      0.57      0.65       528
          BA       0.50      0.56      0.53       354
      BABBAR       0.00      0.00      0.00         1
         BAN       0.00      0.00      0.00         2
         BAP       0.00      0.00      0.00         5
         BAR       0.38      0.37      0.37       171
         BAT       0.00      0.00      0.00        20
          BE       0.54      0.63      0.58       325
          DA       0.57      0.52      0.55       601
         DAŠ       0.00      0.00      0.00         1
         DIN       0.00      0.00      0.00         1
         DIŠ       0.00      0.00      0.00         6
          DU       0.56      0.38      0.45       570
           E       0.00      0.00      0.00        24
          EL       0.00      0.00      0.00         2
          EN       0.00      0.00      0.00         6
      EŠŠANA       0.55      0.33      0.42        63
         GAL       0.57      0.53      0.55       178
         GEŠ       0.00      0.00      0.00         1
      GEŠTIN       0.15      0.10      0.12        41
          GI       0.42      0.30      0.35        37
         GIG       0.00      0.00      0.00         1
         GIŠ       0.38      0.20      0.26       107
         GUD       0.09      0.67      0.16         3
       GURUŠ       0.00      0.00      0.00         8
          HA       0.49      0.53      0.51       195
         HAL       0.62      0.80      0.70      1347
       HALAN       0.00      0.00      0.00         1
         HAR       0.62      0.25      0.36        20
          HI       0.68      0.41      0.51       133
          HU       0.47      0.33      0.39       223
           I       0.10      0.07      0.08        14
          IA       0.55      0.57      0.56       256
          IB       0.00      0.00      0.00        26
          ID       1.00      0.17      0.29         6
          IH       0.00      0.00      0.00         1
          IK       0.52      0.42      0.47        66
          IN       0.62      0.44      0.52        36
          IP       0.51      0.62      0.56       141
          IR       0.49      0.51      0.50       142
          IS       0.00      0.00      0.00         5
          IT       0.00      0.00      0.00         2
         ITI       0.59      0.60      0.59       261
          IZ       0.21      0.28      0.24       106
          IŠ       0.42      0.69      0.52       832
         KAK       0.00      0.00      0.00         5
         KAM       0.33      0.25      0.29         8
        KAP₀       0.00      0.00      0.00         7
         KAR       0.61      0.45      0.52        49
      KASKAL       0.00      0.00      0.00         3
        KAT₇       0.00      0.00      0.00         3
        KAZ₀       0.00      0.00      0.00         3
         KAŠ       0.29      0.49      0.37        57
         KA₄       0.44      0.48      0.46       493
          KI       0.70      0.66      0.68       370
         KIN       0.00      0.00      0.00         3
          KU       0.44      0.44      0.44       170
         KUR       0.67      0.44      0.53       415
         KUŠ       0.00      0.00      0.00         4
         KÁN       0.31      0.36      0.33        42
          KÙ       0.00      0.00      0.00         1
         KÚM       0.08      0.50      0.13         2
          LA       0.00      0.00      0.00        47
          LI       0.36      0.22      0.27        91
          LU       0.24      0.21      0.22        38
          LÚ       0.61      0.40      0.49       129
          MA       0.65      0.79      0.71       580
        MAK₀       0.00      0.00      0.00         4
         MAN       0.62      0.57      0.59       219
         MAR       0.39      0.42      0.40       154
         MAS       0.00      0.00      0.00         2
        MAZ₀       0.47      0.53      0.50        17
         MAŠ       0.00      0.00      0.00        22
          ME       0.50      0.60      0.55       348
         MEŠ       0.57      0.66      0.61       835
          MI       0.85      0.38      0.53       211
         MIN       0.34      0.41      0.37       233
          MU       1.00      0.12      0.22        49
        MUZ₀       0.33      0.14      0.20         7
         MUŠ       0.00      0.00      0.00         0
       MUŠEN       0.00      0.00      0.00         3
         MÍN       0.38      0.22      0.28       197
          NA       0.49      0.63      0.56      1573
          NI       0.30      0.16      0.21        38
          NU       0.62      0.34      0.44       125
       NUMUN       1.00      0.29      0.44         7
        NÍTA       0.00      0.00      0.00        15
          PA       0.33      0.30      0.31        74
         PAN       0.20      0.14      0.17         7
         PAP       0.72      0.46      0.56       123
          PI       0.38      0.32      0.35        91
          PU       0.45      0.36      0.40       151
         PÁR       0.00      0.00      0.00        47
         PÍR       0.20      0.20      0.20        49
          QA       0.19      0.01      0.03       215
          RA       0.74      0.53      0.62       387
         RAD       0.00      0.00      0.00         0
        RAK₀       0.55      0.38      0.44        16
          RI       0.42      0.69      0.52       170
          RU       0.42      0.29      0.34        45
         RÁB       0.00      0.00      0.00         8
         RÁP       0.00      0.00      0.00         5
         RÁŠ       0.22      0.40      0.28        47
          SA       0.23      0.56      0.32        68
         SAL       0.49      0.34      0.40       301
          SI       0.00      0.00      0.00         3
          SU       0.25      0.05      0.08        20
         TAB       0.00      0.00      0.00         3
         TAK       0.00      0.00      0.00         1
         TAL       0.00      0.00      0.00        12
        TAM₅       0.00      0.00      0.00        18
        TAM₆       0.00      0.00      0.00         2
         TAN       0.24      0.23      0.23        57
         TAP       0.00      0.00      0.00         3
         TAR       0.56      0.14      0.22        37
         TAŠ       0.41      0.63      0.50       175
          TE       0.44      0.39      0.41        46
          TI       0.73      0.54      0.62       218
         TIN       0.18      0.14      0.16        14
          TU       0.73      0.19      0.31        57
         TUK       0.11      0.03      0.05        30
         TUP       0.50      0.06      0.11        16
         TUR       0.59      0.30      0.39        44
         TU₄       0.00      0.00      0.00         9
           U       0.20      0.03      0.06        60
          UD       0.00      0.00      0.00        54
         UDU       0.36      0.36      0.36        22
          UG       0.00      0.00      0.00         6
          UK       0.56      0.29      0.38        31
          UL       0.75      0.62      0.68       274
          UM       0.44      0.44      0.44       202
          UN       0.33      0.42      0.37       142
          UR       0.00      0.00      0.00         7
          UT       0.27      0.04      0.07        76
          ZA       0.32      0.34      0.33        94
         ZAP       0.00      0.00      0.00         6
         ZIK       0.00      0.00      0.00         1
        ZIK₀       0.00      0.00      0.00         1
        ZIR₀       0.67      0.12      0.20        17
          ZÍ       0.46      0.51      0.49       113
         ZÍD       0.20      0.01      0.02        89
           ½       0.33      0.63      0.44       141
          ÁŠ       0.00      0.00      0.00        28
           Ì       0.00      0.00      0.00         6
          ÍB       0.00      0.00      0.00         1
          ÍP       0.00      0.00      0.00         4
           Ú       0.38      0.25      0.31        51
         ŠAR       0.00      0.00      0.00         1
          ŠE       0.70      0.27      0.39       242
          ŠI       0.68      0.34      0.46        93
        ŠIR₈       0.00      0.00      0.00         1
          ŠU       0.56      0.10      0.17        88
          ŠÀ       0.00      0.00      0.00         8
          ŠÁ       0.40      0.63      0.49       330

    accuracy                           0.52     22022
   macro avg       0.31      0.25      0.26     22022
weighted avg       0.52      0.52      0.51     22022
