x_train shape: (77073, 50, 50, 1)
y_train shape: (77073,)
Number of images in x_train 77073
Number of images in x_valid 11011
Number of images in x_test 22022
Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 50, 50, 1)]  0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 50, 50, 1)    0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 22, 22, 64)   3200        dropout[0][0]                    
__________________________________________________________________________________________________
bn_conv1 (BatchNormalization)   (None, 22, 22, 64)   256         conv1[0][0]                      
__________________________________________________________________________________________________
activation (Activation)         (None, 22, 22, 64)   0           bn_conv1[0][0]                   
__________________________________________________________________________________________________
pool1_pad (ZeroPadding2D)       (None, 24, 24, 64)   0           activation[0][0]                 
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 11, 11, 64)   0           pool1_pad[0][0]                  
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 11, 11, 64)   4160        max_pooling2d[0][0]              
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 11, 11, 64)   256         res2a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 11, 11, 64)   0           bn2a_branch2a[0][0]              
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 11, 11, 64)   36928       activation_1[0][0]               
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 11, 11, 64)   256         res2a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 11, 11, 64)   0           bn2a_branch2b[0][0]              
__________________________________________________________________________________________________
res2a_branch2c (Conv2D)         (None, 11, 11, 256)  16640       activation_2[0][0]               
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, 11, 11, 256)  16640       max_pooling2d[0][0]              
__________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizati (None, 11, 11, 256)  1024        res2a_branch2c[0][0]             
__________________________________________________________________________________________________
bn2a_branch1 (BatchNormalizatio (None, 11, 11, 256)  1024        res2a_branch1[0][0]              
__________________________________________________________________________________________________
add (Add)                       (None, 11, 11, 256)  0           bn2a_branch2c[0][0]              
                                                                 bn2a_branch1[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 11, 11, 256)  0           add[0][0]                        
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 11, 11, 64)   16448       activation_3[0][0]               
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 11, 11, 64)   256         res2b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 11, 11, 64)   0           bn2b_branch2a[0][0]              
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 11, 11, 64)   36928       activation_4[0][0]               
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 11, 11, 64)   256         res2b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 11, 11, 64)   0           bn2b_branch2b[0][0]              
__________________________________________________________________________________________________
res2b_branch2c (Conv2D)         (None, 11, 11, 256)  16640       activation_5[0][0]               
__________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizati (None, 11, 11, 256)  1024        res2b_branch2c[0][0]             
__________________________________________________________________________________________________
add_1 (Add)                     (None, 11, 11, 256)  0           bn2b_branch2c[0][0]              
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 11, 11, 256)  0           add_1[0][0]                      
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 11, 11, 64)   16448       activation_6[0][0]               
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 11, 11, 64)   256         res2c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 11, 11, 64)   0           bn2c_branch2a[0][0]              
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 11, 11, 64)   36928       activation_7[0][0]               
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 11, 11, 64)   256         res2c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 11, 11, 64)   0           bn2c_branch2b[0][0]              
__________________________________________________________________________________________________
res2c_branch2c (Conv2D)         (None, 11, 11, 256)  16640       activation_8[0][0]               
__________________________________________________________________________________________________
bn2c_branch2c (BatchNormalizati (None, 11, 11, 256)  1024        res2c_branch2c[0][0]             
__________________________________________________________________________________________________
add_2 (Add)                     (None, 11, 11, 256)  0           bn2c_branch2c[0][0]              
                                                                 activation_6[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 11, 11, 256)  0           add_2[0][0]                      
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 6, 6, 128)    32896       activation_9[0][0]               
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 6, 6, 128)    512         res3a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 6, 6, 128)    0           bn3a_branch2a[0][0]              
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 6, 6, 128)    147584      activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 6, 6, 128)    512         res3a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 6, 6, 128)    0           bn3a_branch2b[0][0]              
__________________________________________________________________________________________________
res3a_branch2c (Conv2D)         (None, 6, 6, 512)    66048       activation_11[0][0]              
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 6, 6, 512)    131584      activation_9[0][0]               
__________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizati (None, 6, 6, 512)    2048        res3a_branch2c[0][0]             
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 6, 6, 512)    2048        res3a_branch1[0][0]              
__________________________________________________________________________________________________
add_3 (Add)                     (None, 6, 6, 512)    0           bn3a_branch2c[0][0]              
                                                                 bn3a_branch1[0][0]               
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 6, 6, 512)    0           add_3[0][0]                      
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 6, 6, 128)    65664       activation_12[0][0]              
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 6, 6, 128)    512         res3b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 6, 6, 128)    0           bn3b_branch2a[0][0]              
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 6, 6, 128)    147584      activation_13[0][0]              
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 6, 6, 128)    512         res3b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 6, 6, 128)    0           bn3b_branch2b[0][0]              
__________________________________________________________________________________________________
res3b_branch2c (Conv2D)         (None, 6, 6, 512)    66048       activation_14[0][0]              
__________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizati (None, 6, 6, 512)    2048        res3b_branch2c[0][0]             
__________________________________________________________________________________________________
add_4 (Add)                     (None, 6, 6, 512)    0           bn3b_branch2c[0][0]              
                                                                 activation_12[0][0]              
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 6, 6, 512)    0           add_4[0][0]                      
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 6, 6, 128)    65664       activation_15[0][0]              
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 6, 6, 128)    512         res3c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 6, 6, 128)    0           bn3c_branch2a[0][0]              
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 6, 6, 128)    147584      activation_16[0][0]              
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 6, 6, 128)    512         res3c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 6, 6, 128)    0           bn3c_branch2b[0][0]              
__________________________________________________________________________________________________
res3c_branch2c (Conv2D)         (None, 6, 6, 512)    66048       activation_17[0][0]              
__________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizati (None, 6, 6, 512)    2048        res3c_branch2c[0][0]             
__________________________________________________________________________________________________
add_5 (Add)                     (None, 6, 6, 512)    0           bn3c_branch2c[0][0]              
                                                                 activation_15[0][0]              
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 6, 6, 512)    0           add_5[0][0]                      
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 512)          0           activation_18[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512)          0           global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense (Dense)                   (None, 512)          262656      dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 512)          262656      dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 512)          262656      dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 215)          110295      dense_2[0][0]                    
==================================================================================================
Total params: 2,069,719
Trainable params: 2,061,143
Non-trainable params: 8,576
__________________________________________________________________________________________________
Epoch 1/128
2408/2408 [==============================] - 86s 36ms/step - loss: 3.4731 - accuracy: 0.1946 - val_loss: 3.2319 - val_accuracy: 0.2364
Epoch 2/128
2408/2408 [==============================] - 83s 35ms/step - loss: 2.8140 - accuracy: 0.3037 - val_loss: 2.7367 - val_accuracy: 0.3316
Epoch 3/128
2408/2408 [==============================] - 84s 35ms/step - loss: 2.5369 - accuracy: 0.3642 - val_loss: 2.5897 - val_accuracy: 0.3574
Epoch 4/128
2408/2408 [==============================] - 84s 35ms/step - loss: 2.3695 - accuracy: 0.4018 - val_loss: 2.2989 - val_accuracy: 0.4298
Epoch 5/128
2408/2408 [==============================] - 84s 35ms/step - loss: 2.2616 - accuracy: 0.4262 - val_loss: 2.1373 - val_accuracy: 0.4573
Epoch 6/128
2408/2408 [==============================] - 83s 35ms/step - loss: 2.1760 - accuracy: 0.4447 - val_loss: 2.2033 - val_accuracy: 0.4432
Epoch 7/128
2408/2408 [==============================] - 84s 35ms/step - loss: 2.1003 - accuracy: 0.4620 - val_loss: 2.0498 - val_accuracy: 0.4780
Epoch 8/128
2408/2408 [==============================] - 84s 35ms/step - loss: 2.0431 - accuracy: 0.4752 - val_loss: 2.0201 - val_accuracy: 0.4927
Epoch 9/128
2408/2408 [==============================] - 84s 35ms/step - loss: 1.9987 - accuracy: 0.4858 - val_loss: 1.9693 - val_accuracy: 0.5010
Epoch 10/128
2408/2408 [==============================] - 84s 35ms/step - loss: 1.9556 - accuracy: 0.4969 - val_loss: 1.9461 - val_accuracy: 0.5077
Epoch 11/128
2408/2408 [==============================] - 84s 35ms/step - loss: 1.9168 - accuracy: 0.5079 - val_loss: 2.1232 - val_accuracy: 0.4753
Epoch 12/128
2408/2408 [==============================] - 83s 35ms/step - loss: 1.8770 - accuracy: 0.5142 - val_loss: 2.0045 - val_accuracy: 0.4994
Epoch 13/128
2408/2408 [==============================] - 84s 35ms/step - loss: 1.8526 - accuracy: 0.5204 - val_loss: 1.9635 - val_accuracy: 0.5061
Epoch 14/128
2408/2408 [==============================] - 83s 35ms/step - loss: 1.8194 - accuracy: 0.5275 - val_loss: 1.9690 - val_accuracy: 0.5090
Epoch 15/128
2408/2408 [==============================] - 83s 35ms/step - loss: 1.7958 - accuracy: 0.5348 - val_loss: 1.9042 - val_accuracy: 0.5198
Epoch 16/128
2408/2408 [==============================] - 83s 35ms/step - loss: 1.7729 - accuracy: 0.5395 - val_loss: 1.8703 - val_accuracy: 0.5290
Epoch 17/128
2408/2408 [==============================] - 83s 35ms/step - loss: 1.7474 - accuracy: 0.5452 - val_loss: 2.0040 - val_accuracy: 0.5099
Epoch 18/128
2408/2408 [==============================] - 84s 35ms/step - loss: 1.7286 - accuracy: 0.5489 - val_loss: 1.9035 - val_accuracy: 0.5290
Epoch 19/128
2408/2408 [==============================] - 84s 35ms/step - loss: 1.7088 - accuracy: 0.5530 - val_loss: 1.9732 - val_accuracy: 0.5153
Epoch 20/128
2408/2408 [==============================] - 84s 35ms/step - loss: 1.6894 - accuracy: 0.5568 - val_loss: 1.9086 - val_accuracy: 0.5324
Epoch 21/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.6743 - accuracy: 0.5614 - val_loss: 1.7961 - val_accuracy: 0.5466
Epoch 22/128
2408/2408 [==============================] - 86s 36ms/step - loss: 1.6623 - accuracy: 0.5638 - val_loss: 1.8457 - val_accuracy: 0.5473
Epoch 23/128
2408/2408 [==============================] - 86s 36ms/step - loss: 1.6426 - accuracy: 0.5684 - val_loss: 1.7563 - val_accuracy: 0.5599
Epoch 24/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.6227 - accuracy: 0.5735 - val_loss: 1.8016 - val_accuracy: 0.5482
Epoch 25/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.6102 - accuracy: 0.5753 - val_loss: 1.8010 - val_accuracy: 0.5548
Epoch 26/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.6007 - accuracy: 0.5782 - val_loss: 1.7819 - val_accuracy: 0.5597
Epoch 27/128
2408/2408 [==============================] - 86s 36ms/step - loss: 1.5860 - accuracy: 0.5822 - val_loss: 1.8511 - val_accuracy: 0.5538
Epoch 28/128
2408/2408 [==============================] - 86s 36ms/step - loss: 1.5758 - accuracy: 0.5847 - val_loss: 1.9214 - val_accuracy: 0.5287
Epoch 29/128
2408/2408 [==============================] - 86s 36ms/step - loss: 1.4317 - accuracy: 0.6154 - val_loss: 1.6449 - val_accuracy: 0.5900
Epoch 30/128
2408/2408 [==============================] - 86s 36ms/step - loss: 1.3863 - accuracy: 0.6272 - val_loss: 1.6425 - val_accuracy: 0.5953
Epoch 31/128
2408/2408 [==============================] - 86s 36ms/step - loss: 1.3734 - accuracy: 0.6287 - val_loss: 1.6410 - val_accuracy: 0.5931
Epoch 32/128
2408/2408 [==============================] - 86s 36ms/step - loss: 1.3605 - accuracy: 0.6316 - val_loss: 1.6425 - val_accuracy: 0.5955
Epoch 33/128
2408/2408 [==============================] - 86s 36ms/step - loss: 1.3463 - accuracy: 0.6349 - val_loss: 1.6391 - val_accuracy: 0.5959
Epoch 34/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.3406 - accuracy: 0.6360 - val_loss: 1.6478 - val_accuracy: 0.5940
Epoch 35/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.3303 - accuracy: 0.6395 - val_loss: 1.6449 - val_accuracy: 0.5964
Epoch 36/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.3226 - accuracy: 0.6401 - val_loss: 1.6417 - val_accuracy: 0.5943
Epoch 37/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.3163 - accuracy: 0.6413 - val_loss: 1.6482 - val_accuracy: 0.5928
Epoch 38/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.3124 - accuracy: 0.6434 - val_loss: 1.6449 - val_accuracy: 0.5958
Epoch 39/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2985 - accuracy: 0.6457 - val_loss: 1.6376 - val_accuracy: 0.5987
Epoch 40/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2914 - accuracy: 0.6485 - val_loss: 1.6386 - val_accuracy: 0.5991
Epoch 41/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2894 - accuracy: 0.6484 - val_loss: 1.6394 - val_accuracy: 0.6000
Epoch 42/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2893 - accuracy: 0.6483 - val_loss: 1.6402 - val_accuracy: 0.5994
Epoch 43/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2904 - accuracy: 0.6479 - val_loss: 1.6354 - val_accuracy: 0.5991
Epoch 44/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2855 - accuracy: 0.6483 - val_loss: 1.6394 - val_accuracy: 0.5989
Epoch 45/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2874 - accuracy: 0.6485 - val_loss: 1.6374 - val_accuracy: 0.5999
Epoch 46/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2830 - accuracy: 0.6501 - val_loss: 1.6367 - val_accuracy: 0.5999
Epoch 47/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2832 - accuracy: 0.6487 - val_loss: 1.6381 - val_accuracy: 0.5998
Epoch 48/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2821 - accuracy: 0.6512 - val_loss: 1.6379 - val_accuracy: 0.5996
Epoch 49/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2795 - accuracy: 0.6493 - val_loss: 1.6389 - val_accuracy: 0.5995
Epoch 50/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2847 - accuracy: 0.6474 - val_loss: 1.6407 - val_accuracy: 0.5992
Epoch 51/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2765 - accuracy: 0.6524 - val_loss: 1.6384 - val_accuracy: 0.5994
Epoch 52/128
2408/2408 [==============================] - 85s 35ms/step - loss: 1.2800 - accuracy: 0.6497 - val_loss: 1.6398 - val_accuracy: 0.5991
Epoch 53/128
2408/2408 [==============================] - 86s 36ms/step - loss: 1.2822 - accuracy: 0.6490 - val_loss: 1.6370 - val_accuracy: 0.5991
689/689 [==============================] - 7s 10ms/step - loss: 1.6197 - accuracy: 0.6057
test loss, test acc: [1.6197222471237183, 0.6056670546531677]

x_test shape: (22022, 50, 50, 1)
symbol names: ['1' '10' '14' '1½' '2' '20' '23' '3' '30' '4' '40' '5' '50' '6' '60' '7'
 '70' '8' '80' '9' '90' 'A' 'AB' 'AD' 'AG' 'AH' 'AK' 'AM' 'AN' 'ANŠE'
 'ANŠE.KUR.RA' 'AP' 'APIN' 'AT' 'AZ' 'AŠ' 'BA' 'BABBAR' 'BAD' 'BAK' 'BAN'
 'BAP' 'BAR' 'BAT' 'BE' 'BU' 'DA' 'DAŠ' 'DIN' 'DIŠ' 'DU' 'DUMU' 'E' 'EL'
 'EN' 'EŠŠANA' 'GAL' 'GEŠ' 'GEŠTIN' 'GI' 'GIG' 'GIR' 'GIŠ' 'GI₄' 'GUD'
 'GURUŠ' 'HA' 'HAL' 'HALAN' 'HAR' 'HI' 'HU' 'I' 'IA' 'IB' 'ID' 'IH' 'IK'
 'IM' 'IN' 'IP' 'IR' 'IS' 'IT' 'ITI' 'IZ' 'IŠ' 'KAK' 'KAM' 'KAP₀' 'KAR'
 'KASKAL' 'KAT₇' 'KAZ₀' 'KAŠ' 'KA₄' 'KI' 'KI+MIN' 'KIN' 'KU' 'KUR' 'KUT'
 'KUŠ' 'KÁN' 'KÙ' 'KÚM' 'LA' 'LAK' 'LI' 'LU' 'LÚ' 'MA' 'MAK₀' 'MAN' 'MAR'
 'MAS' 'MAZ₀' 'MAŠ' 'ME' 'MEŠ' 'MI' 'MIN' 'MU' 'MUZ₀' 'MUŠ' 'MUŠEN' 'MÍN'
 'NA' 'NAP' 'NI' 'NU' 'NUMUN' 'NÍTA' 'PA' 'PAN' 'PAP' 'PI' 'PU' 'PÁR'
 'PÍR' 'QA' 'RA' 'RAD' 'RAK₀' 'RAT' 'RI' 'RU' 'RÁB' 'RÁP' 'RÁŠ' 'SA' 'SAL'
 'SI' 'SU' 'TA' 'TAB' 'TAK' 'TAL' 'TAM₅' 'TAM₆' 'TAN' 'TAP' 'TAR' 'TAŠ'
 'TE' 'TI' 'TIN' 'TU' 'TUB' 'TUK' 'TUP' 'TUR' 'TU₄' 'U' 'UD' 'UDU' 'UG'
 'UH' 'UK' 'UL' 'UM' 'UN' 'UR' 'UT' 'ZA' 'ZAB' 'ZAP' 'ZI' 'ZIB' 'ZIK'
 'ZIK₀' 'ZIL₀' 'ZIP' 'ZIR₀' 'ZÍ' 'ZÍD' '½' 'ÁŠ' 'Ì' 'ÍB' 'ÍP' 'Ú' 'ŠAB₀'
 'ŠAP₀' 'ŠAR' 'ŠE' 'ŠI' 'ŠIB₀' 'ŠIR₈' 'ŠU' 'ŠÀ' 'ŠÁ' 'ḪAR' '⅓' '⅔']
Top 5 accuracy:
0.8422486604304786

              precision    recall  f1-score   support

           1       0.65      0.76      0.70       557
          10       0.62      0.67      0.64       203
          14       0.00      0.00      0.00         1
           2       0.66      0.68      0.67       400
          20       0.71      0.73      0.72       308
          23       0.00      0.00      0.00         1
           3       0.75      0.76      0.76       313
          30       0.58      0.66      0.62        68
           4       0.64      0.51      0.57       177
          40       0.72      0.47      0.57        45
           5       0.54      0.53      0.54       135
          50       0.65      0.42      0.52        40
           6       0.75      0.55      0.63       124
          60       0.00      0.00      0.00        32
           7       0.67      0.47      0.55        73
          70       0.52      0.55      0.53        22
           8       0.64      0.58      0.61        89
          80       0.55      0.30      0.39        20
           9       0.65      0.62      0.64        76
          90       0.47      0.47      0.47        17
           A       0.56      0.59      0.57       114
          AB       0.00      0.00      0.00        13
          AD       0.38      0.25      0.30        12
          AG       0.00      0.00      0.00         1
          AK       0.54      0.57      0.56       194
          AM       0.88      0.37      0.52        19
          AN       0.68      0.67      0.68       666
        ANŠE       0.37      0.83      0.51        12
          AP       0.39      0.45      0.42        64
        APIN       0.00      0.00      0.00         1
          AT       0.67      0.21      0.32        19
          AŠ       0.72      0.72      0.72       528
          BA       0.55      0.61      0.58       354
      BABBAR       0.00      0.00      0.00         1
         BAN       0.00      0.00      0.00         2
         BAP       0.00      0.00      0.00         5
         BAR       0.48      0.43      0.46       171
         BAT       0.00      0.00      0.00        20
          BE       0.64      0.64      0.64       325
          DA       0.60      0.67      0.63       601
         DAŠ       0.00      0.00      0.00         1
         DIN       0.00      0.00      0.00         1
         DIŠ       0.00      0.00      0.00         6
          DU       0.59      0.58      0.58       570
           E       0.23      0.12      0.16        24
          EL       0.00      0.00      0.00         2
          EN       0.00      0.00      0.00         6
      EŠŠANA       0.52      0.51      0.52        63
         GAL       0.63      0.60      0.61       178
         GEŠ       0.00      0.00      0.00         1
      GEŠTIN       0.28      0.20      0.23        41
          GI       0.56      0.54      0.55        37
         GIG       0.00      0.00      0.00         1
         GIŠ       0.45      0.33      0.38       107
         GUD       0.67      0.67      0.67         3
       GURUŠ       0.00      0.00      0.00         8
          HA       0.69      0.69      0.69       195
         HAL       0.72      0.81      0.76      1347
       HALAN       0.00      0.00      0.00         1
         HAR       0.64      0.45      0.53        20
          HI       0.59      0.57      0.58       133
          HU       0.62      0.66      0.64       223
           I       0.60      0.43      0.50        14
          IA       0.72      0.64      0.68       256
          IB       0.00      0.00      0.00        26
          ID       0.43      0.50      0.46         6
          IH       0.00      0.00      0.00         1
          IK       0.55      0.55      0.55        66
          IN       0.71      0.61      0.66        36
          IP       0.65      0.71      0.68       141
          IR       0.60      0.63      0.61       142
          IS       0.00      0.00      0.00         5
          IT       0.00      0.00      0.00         2
         ITI       0.66      0.69      0.67       261
          IZ       0.38      0.21      0.27       106
          IŠ       0.61      0.63      0.62       832
         KAK       0.50      0.20      0.29         5
         KAM       0.33      0.12      0.18         8
        KAP₀       0.00      0.00      0.00         7
         KAR       0.54      0.69      0.61        49
      KASKAL       0.00      0.00      0.00         3
        KAT₇       0.00      0.00      0.00         3
        KAZ₀       0.00      0.00      0.00         3
         KAŠ       0.55      0.30      0.39        57
         KA₄       0.50      0.56      0.53       493
          KI       0.66      0.74      0.70       370
         KIN       0.14      0.33      0.20         3
          KU       0.46      0.54      0.49       170
         KUR       0.62      0.57      0.60       415
         KUŠ       0.00      0.00      0.00         4
         KÁN       0.60      0.43      0.50        42
          KÙ       0.00      0.00      0.00         1
         KÚM       0.00      0.00      0.00         2
          LA       0.52      0.34      0.41        47
          LI       0.51      0.35      0.42        91
          LU       0.25      0.29      0.27        38
          LÚ       0.65      0.52      0.58       129
          MA       0.72      0.81      0.76       580
        MAK₀       0.00      0.00      0.00         4
         MAN       0.68      0.63      0.66       219
         MAR       0.53      0.41      0.46       154
         MAS       0.00      0.00      0.00         2
        MAZ₀       0.79      0.65      0.71        17
         MAŠ       0.00      0.00      0.00        22
          ME       0.66      0.65      0.65       348
         MEŠ       0.60      0.77      0.67       835
          MI       0.69      0.61      0.64       211
         MIN       0.52      0.51      0.52       233
          MU       0.52      0.35      0.41        49
        MUZ₀       0.50      0.14      0.22         7
       MUŠEN       0.00      0.00      0.00         3
         MÍN       0.43      0.27      0.33       197
          NA       0.54      0.74      0.62      1573
          NI       0.52      0.29      0.37        38
          NU       0.58      0.52      0.55       125
       NUMUN       1.00      0.29      0.44         7
        NÍTA       1.00      0.07      0.12        15
          PA       0.41      0.23      0.30        74
         PAN       0.25      0.14      0.18         7
         PAP       0.68      0.54      0.61       123
          PI       0.46      0.43      0.45        91
          PU       0.55      0.46      0.50       151
         PÁR       0.32      0.19      0.24        47
         PÍR       0.30      0.20      0.24        49
          QA       0.31      0.09      0.14       215
          RA       0.62      0.72      0.67       387
        RAK₀       0.86      0.38      0.52        16
          RI       0.66      0.60      0.63       170
          RU       0.50      0.40      0.44        45
         RÁB       0.00      0.00      0.00         8
         RÁP       0.00      0.00      0.00         5
         RÁŠ       0.25      0.23      0.24        47
          SA       0.63      0.59      0.61        68
         SAL       0.53      0.55      0.54       301
          SI       0.50      0.33      0.40         3
          SU       0.30      0.15      0.20        20
         TAB       1.00      0.33      0.50         3
         TAK       0.00      0.00      0.00         1
         TAL       0.00      0.00      0.00        12
        TAM₅       0.00      0.00      0.00        18
        TAM₆       0.00      0.00      0.00         2
         TAN       0.47      0.30      0.37        57
         TAP       0.00      0.00      0.00         3
         TAR       0.54      0.19      0.28        37
         TAŠ       0.66      0.71      0.69       175
          TE       0.60      0.46      0.52        46
          TI       0.66      0.67      0.67       218
         TIN       0.36      0.29      0.32        14
          TU       0.48      0.56      0.52        57
         TUK       0.00      0.00      0.00        30
         TUP       0.83      0.31      0.45        16
         TUR       0.43      0.45      0.44        44
         TU₄       1.00      0.11      0.20         9
           U       0.39      0.12      0.18        60
          UD       0.00      0.00      0.00        54
         UDU       0.25      0.05      0.08        22
          UG       0.00      0.00      0.00         6
          UK       0.45      0.45      0.45        31
          UL       0.68      0.74      0.71       274
          UM       0.51      0.58      0.54       202
          UN       0.58      0.51      0.55       142
          UR       0.00      0.00      0.00         7
          UT       0.29      0.26      0.28        76
          ZA       0.49      0.48      0.49        94
         ZAP       0.00      0.00      0.00         6
         ZIK       0.00      0.00      0.00         1
        ZIK₀       0.00      0.00      0.00         1
        ZIR₀       0.35      0.35      0.35        17
          ZÍ       0.58      0.54      0.56       113
         ZÍD       0.14      0.02      0.04        89
           ½       0.58      0.61      0.59       141
          ÁŠ       0.00      0.00      0.00        28
           Ì       0.00      0.00      0.00         6
          ÍB       0.00      0.00      0.00         1
          ÍP       0.00      0.00      0.00         4
           Ú       0.52      0.51      0.51        51
        ŠAP₀       0.00      0.00      0.00         0
         ŠAR       0.00      0.00      0.00         1
          ŠE       0.54      0.50      0.52       242
          ŠI       0.69      0.57      0.62        93
        ŠIR₈       0.00      0.00      0.00         1
          ŠU       0.53      0.11      0.19        88
          ŠÀ       0.00      0.00      0.00         8
          ŠÁ       0.53      0.59      0.56       330

    accuracy                           0.61     22022
   macro avg       0.39      0.33      0.34     22022
weighted avg       0.59      0.61      0.59     22022

Confusion matrix:
 QA: array([ 3,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  0,  1,  0,  3,  0,  0,  0,  0,  1, 11,  0,0,  0,  2,  0,  4,  2,  0,  0,  0,  6,  0,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  2,  4,  0,  0,  0,  0,  0,  0,  0,  0, 87,1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  3,  0,  0,  1,  0,0,  0,  0,  2,  0,  1,  0,  0,  0,  1, 50,  0,  0,  0,  0,  0,  0,1,  1,  0,  0,  0, 19,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  0,  0,  0,  5,  0,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  1],  dtype=int64)
 UD: array([ 0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  4,  0,0,  0,  1,  0,  2,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  1,  1,  0,  0,  0,  0,  0,  0,  0,  0, 19,0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,0,  0,  1,  1,  0,  1,  0,  0,  0,  0,  4,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  1,  0,  0, 12,  0,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  1],  dtype=int64)
ZÍD: array([ 0,  0,  0,  0,  0,  0,  1,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  2,  0,  0,  1,0,  0,  0,  0,  0,  1,  4,  0,  0,  2,  0,  0,  0,  0,  0,  0,  0,0,  0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,5,  0, 40,  0,  0,  0,  0,  0,  0,  0,  3,  0,  0,  0,  0,  0,  0,0,  0,  0, 14,  0,  0,  1,  0,  0,  1,  2,  0,  0,  0,  0,  0,  0,0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0,  0,0,  0,  0,  0,  0,  0,  0,  0,  3,  0,  0,  0,  0,  0,  0,  1,  0,0,  0,  0,  0,  0,  1,  0,  0,  0,  0,  1,  0,  0,  0,  0,  0,  2,0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],  dtype=int64)
key: ['1', '10', '14', '2', '20', '23', '3', '30', '4', '40', '5', '50', '6', '60', '7', '70', '8', '80', '9', '90', 'A', 'AB', 'AD', 'AG', 'AK', 'AM', 'AN', 'ANŠE', 'AP', 'APIN', 'AT', 'AŠ', 'BA', 'BABBAR', 'BAN', 'BAP', 'BAR', 'BAT', 'BE', 'DA', 'DAŠ', 'DIN', 'DIŠ', 'DU', 'E', 'EL', 'EN', 'EŠŠANA', 'GAL', 'GEŠ', 'GEŠTIN', 'GI', 'GIG', 'GIŠ', 'GUD', 'GURUŠ', 'HA', 'HAL', 'HALAN', 'HAR', 'HI', 'HU', 'I', 'IA', 'IB', 'ID', 'IH', 'IK', 'IN', 'IP', 'IR', 'IS', 'IT', 'ITI', 'IZ', 'IŠ', 'KAK', 'KAM', 'KAP₀', 'KAR', 'KASKAL', 'KAT₇', 'KAZ₀', 'KAŠ', 'KA₄', 'KI', 'KIN', 'KU', 'KUR', 'KUŠ', 'KÁN', 'KÙ', 'KÚM', 'LA', 'LI', 'LU', 'LÚ', 'MA', 'MAK₀', 'MAN', 'MAR', 'MAS', 'MAZ₀', 'MAŠ', 'ME', 'MEŠ', 'MI', 'MIN', 'MU', 'MUZ₀', 'MUŠEN', 'MÍN', 'NA', 'NI', 'NU', 'NUMUN', 'NÍTA', 'PA', 'PAN', 'PAP', 'PI', 'PU', 'PÁR', 'PÍR', 'QA', 'RA', 'RAK₀', 'RI', 'RU', 'RÁB', 'RÁP', 'RÁŠ', 'SA', 'SAL', 'SI', 'SU', 'TAB', 'TAK', 'TAL', 'TAM₅', 'TAM₆', 'TAN', 'TAP', 'TAR', 'TAŠ', 'TE', 'TI', 'TIN', 'TU', 'TUK', 'TUP', 'TUR', 'TU₄', 'U', 'UD', 'UDU', 'UG', 'UK', 'UL', 'UM', 'UN', 'UR', 'UT', 'ZA', 'ZAP', 'ZIK', 'ZIK₀', 'ZIR₀', 'ZÍ', 'ZÍD', '½', 'ÁŠ', 'Ì', 'ÍB', 'ÍP', 'Ú', 'ŠAP₀', 'ŠAR', 'ŠE', 'ŠI', 'ŠIR₈', 'ŠU', 'ŠÀ', 'ŠÁ']
